{
  "architectures": [
    "YolosForObjectDetection"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_loss": false,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "dtype": "float32",
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 192,
  "id2label": {
    "0": "Red Box",
    "1": "Green Bottle",
    "2": "Blue Box",
    "3": "Yellow Bottle",
    "4": "Purple Can",
    "5": "Orange Box",
    "6": "Pink Soap",
    "7": "Black Energy Drink",
    "8": "Sky Milk Carton",
    "9": "Cyan Shampoo",
    "10": "Brown Coffee Jar",
    "11": "Forest Tea Box",
    "12": "Magenta Lotion",
    "13": "Silver Soup Can",
    "14": "Gold Perfume",
    "15": "Navy Body Wash",
    "16": "White Deodorant",
    "17": "Peach Juice",
    "18": "Olive Oil",
    "19": "Bronze Tuna Tin",
    "20": "Coral Shampoo",
    "21": "Neon Energy Drink",
    "22": "Lime Juice Box",
    "23": "Clear Water Bottle"
  },
  "image_size": [
    800,
    1333
  ],
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "label2id": {
    "Black Energy Drink": 7,
    "Blue Box": 2,
    "Bronze Tuna Tin": 19,
    "Brown Coffee Jar": 10,
    "Clear Water Bottle": 23,
    "Coral Shampoo": 20,
    "Cyan Shampoo": 9,
    "Forest Tea Box": 11,
    "Gold Perfume": 14,
    "Green Bottle": 1,
    "Lime Juice Box": 22,
    "Magenta Lotion": 12,
    "Navy Body Wash": 15,
    "Neon Energy Drink": 21,
    "Olive Oil": 18,
    "Orange Box": 5,
    "Peach Juice": 17,
    "Pink Soap": 6,
    "Purple Can": 4,
    "Red Box": 0,
    "Silver Soup Can": 13,
    "Sky Milk Carton": 8,
    "White Deodorant": 16,
    "Yellow Bottle": 3
  },
  "layer_norm_eps": 1e-12,
  "model_type": "yolos",
  "num_attention_heads": 3,
  "num_channels": 3,
  "num_detection_tokens": 100,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "transformers_version": "5.12.1",
  "use_mid_position_embeddings": false
}
